##################################################################################################################################################
print('-------------------------------------------------------------------------------------------------------------------------------------\n\n')
##################################################################################################################################################

# Faça um programa que leia uma frase pelo teclado e mostre:
# Quantas vezes aparece a letra "A"
# Em que posição ela aparece a primeira vez
# Em que posição ela aparece a última vez
# Frase utilizada "grave e cabisbaixo, o filho justo zelava pela querida mae doente"

frase = str(input("Digite uma frase:")).lower()
print("A letra \"A\" apareceu {} vezes na frase.".format(frase.count('a')))
print("A Primeira letra \"A\" apareceu na posição {}.".format(frase.find('a')+1))
print("A última letra \"A\" apareceu na posição {}".format(frase.rfind('a')))
##################################################################################################################################################
print('\n\n-------------------------------------------------------------------------------------------------------------------------------------')
##################################################################################################################################################